In [1]:
import pandas as pd
import numpy as np

In [2]:
application_df = pd.read_csv('Resources/application_record.csv')
credit_df = pd.read_csv('Resources/credit_record.csv')

In [3]:
application_df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [97]:
application_df["Gender"] = application_df["CODE_GENDER"]
application_df["OwnsCar"] = application_df["FLAG_OWN_CAR"]
application_df["OwnsRealty"] = application_df["FLAG_OWN_REALTY"]
application_df["EducationType"] = application_df["NAME_EDUCATION_TYPE"]
application_df["FamilyStatus"] = application_df["NAME_FAMILY_STATUS"]
application_df["HousingType"] = application_df["NAME_HOUSING_TYPE"]
application_df["Phone"] = application_df["FLAG_MOBIL"]
application_df["ChildrenCount"] = application_df["CNT_CHILDREN"]
application_df["Income"] = application_df["AMT_INCOME_TOTAL"].astype('int64', copy=False)
application_df["FamilyMemberCount"] = application_df["CNT_FAM_MEMBERS"].astype('int64', copy=False)
application_df["BirthDays"] = application_df["DAYS_BIRTH"]*-1
application_df["EmployedDays"] = application_df["DAYS_EMPLOYED"]*-1
application_df["Email"] = application_df["FLAG_EMAIL"]
application_df["IncomeType"] = application_df["NAME_INCOME_TYPE"]
application_df["Age"] = application_df["DAYS_BIRTH"]*-1/365
application_df["EmployeeYears"] = application_df["DAYS_EMPLOYED"]*-1/365
application_df['ChildrenCountCategory'] = application_df.CNT_CHILDREN.apply(lambda x : '2' if x>= 2 else str(x))

application_df['FamilyMemberCountCategory'] = application_df.FamilyMemberCount.apply(lambda x : '3' if x>= 4 else str(x))

income_bins = [0, 70000, 100000, 150000, 200000, 250000, 300000, 350000, 1600000]
income_labels = ['70000', '100000', '150000', '200000', '250000', '300000', '350000', '1600000']
application_df['IncomeCategory'] = pd.cut(application_df['Income'], bins = income_bins, labels = income_labels)

age_bins = [19, 27, 30, 35, 40, 45, 50, 55, 62, 70]
age_labels = ['27','30','35','40','45','50','55','62','70']
application_df['AgeCategory'] = pd.cut(application_df['Age'], bins = age_bins,labels = age_labels)

gender = {'M':0, 'F':1}
car = {'Y':1, 'N':0}
realty = {'Y':1, 'N':0}
education = {'Higher education': 0, 'Secondary / secondary special': 1, 'Incomplete higher': 2,
            'Lower secondary':3, 'Academic degree': 4, 'Academic degree': 5}
family = {'Civil marriage':0, 'Married':1, 'Single / not married':2, 'Separated':3,'Widow':4}
housing = {'Rented apartment':0, 'House / apartment':1, 'Municipal apartment':2,
       'With parents':3, 'Co-op apartment':4, 'Office apartment':5}
incomeType = {'Working':0,'Commercial associate':1,'Pensioner':2,'State servant':3,'Student':4}

application_df.Gender = [gender[item] for item in application_df.Gender]
application_df.OwnsCar = [car[item] for item in application_df.OwnsCar]
application_df.OwnsRealty = [realty[item] for item in application_df.OwnsRealty]
application_df.EducationType = [education[item] for item in application_df.EducationType]
application_df.FamilyStatus = [family[item] for item in application_df.FamilyStatus]
application_df.HousingType = [housing[item] for item in application_df.HousingType]
application_df.IncomeType = [incomeType[item] for item in application_df.IncomeType]

application_df['EmployeeYears'] = application_df.EmployeeYears.apply(lambda x : -1 if x<0 else x)

employee_bins = [-2, -1,  5, 10, 15,  20, 50]
employee_labels = ['-1','5','10','15','20','21']
application_df['EmployeeYearsCategory'] = pd.cut(application_df['EmployeeYears'], 
                                                 bins = employee_bins, labels = employee_labels)

credit_application_df = application_df[["ID","Gender", "OwnsCar", "OwnsRealty", "EducationType","FamilyStatus",
                                        "BirthDays","EmployedDays","HousingType","ChildrenCount", "Income", 
                                        "FamilyMemberCount","Email","IncomeType","Age","EmployeeYears",
                                        "ChildrenCountCategory","IncomeCategory","FamilyMemberCountCategory",
                                        "EmployeeYearsCategory","AgeCategory"]]

credit_application_df.head(20)

,ID,Gender,OwnsCar,OwnsRealty,EducationType,FamilyStatus,BirthDays,EmployedDays,HousingType,ChildrenCount,...,FamilyMemberCount,Email,IncomeType,Age,EmployeeYears,ChildrenCountCategory,IncomeCategory,FamilyMemberCountCategory,EmployeeYearsCategory,AgeCategory
0,5008804,0,1,1,0,0,12005,4542,0,0,...,2,0,0,32.890411,12.443836,0,1600000,2,15,35
1,5008805,0,1,1,0,0,12005,4542,0,0,...,2,0,0,32.890411,12.443836,0,1600000,2,15,35
2,5008806,0,1,1,1,1,21474,1134,1,0,...,2,0,0,58.832877,3.106849,0,150000,2,5,62
3,5008808,1,0,1,1,2,19110,3051,1,0,...,1,1,1,52.356164,8.358904,0,300000,1,10,55
4,5008809,1,0,1,1,2,19110,3051,1,0,...,1,1,1,52.356164,8.358904,0,300000,1,10,55
5,5008810,1,0,1,1,2,19110,3051,1,0,...,1,1,1,52.356164,8.358904,0,300000,1,10,55
6,5008811,1,0,1,1,2,19110,3051,1,0,...,1,1,1,52.356164,8.358904,0,300000,1,10,55
7,5008812,1,0,1,0,3,22464,-365243,1,0,...,1,0,2,61.545205,-1.000000,0,300000,1,-1,62
8,5008813,1,0,1,0,3,22464,-365243,1,0,...,1,0,2,61.545205,-1.000000,0,300000,1,-1,62
9,5008814,1,0,1,0,3,22464,-365243,1,0,...,1,0,2,61.545205,-1.000000,0,300000,1,-1,62
10,5008815,0,1,1,0,1,16872,769,1,0,...,2,1,0,46.224658,2.106849,0,300000,2,5,50
11,5112956,0,1,1,0,1,16872,769,1,0,...,2,1,0,46.224658,2.106849,0,300000,2,5,50
12,6153651,0,1,1,0,1,16872,769,1,0,...,2,1,0,46.224658,2.106849,0,300000,2,5,50
13,5008819,0,1,1,1,1,17778,1194,1,0,...,2,0,1,48.706849,3.271233,0,150000,2,5,50
14,5008820,0,1,1,1,1,17778,1194,1,0,...,2,0,1,48.706849,3.271233,0,150000,2,5,50
15,5008821,0,1,1,1,1,17778,1194,1,0,...,2,0,1,48.706849,3.271233,0,150000,2,5,50
16,5008822,0,1,1,1,1,17778,1194,1,0,...,2,0,1,48.706849,3.271233,0,150000,2,5,50
17,5008823,0,1,1,1,1,17778,1194,1,0,...,2,0,1,48.706849,3.271233,0,150000,2,5,50
18,5008824,0,1,1,1,1,17778,1194,1,0,...,2,0,1,48.706849,3.271233,0,150000,2,5,50
19,5008825,1,1,0,2,1,10669,1103,1,0,...,2,0,0,29.230137,3.021918,0,150000,2,5,30

In [98]:
#In the end, I belive the customer should be labeled "good" or "bad" 
#according to the amount of times that customer exceed the 59 days over 
#due limit or has bad debts (status 2 till 5). 

# 0: 1-29 days past due 
# 1: 30-59 days past due 
# 2: 60-89 days overdue 
# 3: 90-119 days overdue 
# 4: 120-149 days overdue 
# 5: Overdue or bad debts, write-offs for more than 150 days 
# C: paid off that month 
# X: No loan for the month

conditions = [
                (credit_df['STATUS'] == 'X'),
                (credit_df['STATUS'] == 'C'),
                (credit_df['STATUS'] == '0'),
                (credit_df['STATUS'] >= "1")
            ]
choices = ['Good','Good','Good','Bad']
credit_df['Label'] = np.select(conditions, choices)

credit_df.head()

        ID  MONTHS_BALANCE STATUS Label
0  5001711               0      X  Good
1  5001711              -1      0  Good
2  5001711              -2      0  Good
3  5001711              -3      0  Good
4  5001712               0      C  Good

In [99]:
grouped_credit_df = credit_df.groupby(['ID', 'Label'])

credit_label_count_df = grouped_credit_df.count()

credit_label_df = credit_label_count_df.reset_index()
credit_label_df.head(10)

        ID Label  MONTHS_BALANCE  STATUS
0  5001711  Good               4       4
1  5001712  Good              19      19
2  5001713  Good              22      22
3  5001714  Good              15      15
4  5001715  Good              60      60
5  5001717  Good              22      22
6  5001718   Bad               2       2
7  5001718  Good              37      37
8  5001719  Good              43      43
9  5001720   Bad               7       7

In [100]:
credit_good_df = credit_label_df.loc[credit_label_df["Label"] == 'Good']
credit_bad_df = credit_label_df.loc[credit_label_df["Label"] == 'Bad']

In [101]:
credit_merge_df = credit_good_df.merge(credit_bad_df,how='outer',on= 'ID')
credit_merge_df.head(10)

,ID,Label_x,MONTHS_BALANCE_x,STATUS_x,Label_y,MONTHS_BALANCE_y,STATUS_y
0,5001711,Good,4.0,4.0,NaN,NaN,NaN
1,5001712,Good,19.0,19.0,NaN,NaN,NaN
2,5001713,Good,22.0,22.0,NaN,NaN,NaN
3,5001714,Good,15.0,15.0,NaN,NaN,NaN
4,5001715,Good,60.0,60.0,NaN,NaN,NaN
5,5001717,Good,22.0,22.0,NaN,NaN,NaN
6,5001718,Good,37.0,37.0,Bad,2.0,2.0
7,5001719,Good,43.0,43.0,NaN,NaN,NaN
8,5001720,Good,29.0,29.0,Bad,7.0,7.0
9,5001723,Good,31.0,31.0,NaN,NaN,NaN

In [102]:
# Bad applicants
credit_all_df1 = credit_merge_df.loc[credit_merge_df['STATUS_y'] >= 1]

# Good applicants
credit_all_df2 = credit_merge_df.loc[credit_merge_df['Label_y'].isnull()]

# Bad applicants
credit_all_df3 = credit_merge_df.loc[credit_merge_df['Label_x'].isnull()]

# Good applicants
credit_all_df4 = credit_merge_df.loc[(credit_merge_df['STATUS_x'] >= 0.0) &
                                     (credit_merge_df['STATUS_y'] < 1)]

credit_all_df1 = credit_all_df1.rename(columns={'Label_y':'Label'})
credit_all_df1 = credit_all_df1[['ID','Label']]

credit_all_df2 = credit_all_df2.rename(columns={'Label_x':'Label'})
credit_all_df2 = credit_all_df2[['ID','Label']]

credit_all_df3 = credit_all_df3.rename(columns={'Label_y':'Label'})
credit_all_df3 = credit_all_df3[['ID','Label']]

credit_all_df4 = credit_all_df4.rename(columns={'Label_x':'Label'})
credit_all_df4 = credit_all_df4[['ID','Label']]

credit_all_df = pd.concat([credit_all_df1,credit_all_df2,credit_all_df3,credit_all_df4])   
credit_all_df.head(10)

          ID Label
6    5001718   Bad
8    5001720   Bad
35   5001757   Bad
57   5001786   Bad
63   5001792   Bad
64   5001793   Bad
78   5001816   Bad
79   5001817   Bad
94   5001836   Bad
102  5001844   Bad

In [103]:
credit_application_all_df = credit_application_df.merge(credit_all_df,how='inner',on='ID')

credit_application_all_df = credit_application_all_df[["Gender", "OwnsCar", "OwnsRealty", "EducationType","FamilyStatus",
                                        "HousingType","Email","IncomeType",
                                        "ChildrenCountCategory","IncomeCategory","FamilyMemberCountCategory",
                                        "EmployeeYearsCategory","AgeCategory","Label"]]

credit_application_all_df = credit_application_all_df.drop_duplicates()
credit_application_all_df.count()

Gender                       8875
OwnsCar                      8875
OwnsRealty                   8875
EducationType                8875
FamilyStatus                 8875
HousingType                  8875
Email                        8875
IncomeType                   8875
ChildrenCountCategory        8875
IncomeCategory               8875
FamilyMemberCountCategory    8875
EmployeeYearsCategory        8875
AgeCategory                  8875
Label                        8875
dtype: int64

In [104]:
credit_application_all_df.head(15)

,Gender,OwnsCar,OwnsRealty,EducationType,FamilyStatus,HousingType,Email,IncomeType,ChildrenCountCategory,IncomeCategory,FamilyMemberCountCategory,EmployeeYearsCategory,AgeCategory,Label
0,0,1,1,0,0,0,0,0,0,1600000,2,15,35,Bad
2,0,1,1,1,1,1,0,0,0,150000,2,5,62,Good
3,1,0,1,1,2,1,1,1,0,300000,1,10,55,Good
7,1,0,1,0,3,1,0,2,0,300000,1,-1,62,Good
10,0,1,1,0,1,1,1,0,0,300000,2,5,50,Good
12,0,1,1,1,1,1,0,1,0,150000,2,5,50,Good
18,1,1,0,2,1,1,0,0,0,150000,2,5,30,Bad
20,1,0,1,1,1,1,0,0,0,200000,2,5,30,Bad
23,1,0,1,1,2,1,0,0,1,150000,2,5,35,Good
25,0,1,1,1,1,1,0,0,2,300000,3,5,35,Good
27,0,0,1,0,1,1,0,1,1,1600000,3,10,35,Good
33,0,1,1,1,1,1,0,1,0,150000,2,15,62,Good
41,1,1,1,1,1,1,0,0,2,150000,3,10,45,Good
56,1,0,1,1,0,1,0,3,1,250000,3,20,45,Good
58,0,1,1,1,1,1,0,1,0,1600000,2,15,50,Bad

In [105]:
X = credit_application_all_df[["Gender", "OwnsCar", "OwnsRealty", "EducationType","FamilyStatus",
                                        "HousingType","Email","IncomeType",
                                        "ChildrenCountCategory","IncomeCategory","FamilyMemberCountCategory",
                                        "EmployeeYearsCategory","AgeCategory"]]
y = credit_application_all_df['Label']

print(X.shape, y.shape)

(8875, 13) (8875,)

In [106]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [107]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [108]:
classifier.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [109]:
from sklearn.metrics import accuracy_score

print(f"Training Data Score: {classifier.score(X_train, y_train)}")
print(f"Testing Data Score: {classifier.score(X_test, y_test)}")

Training Data Score: 0.7608173076923077
Testing Data Score: 0.7431275349256422

In [110]:
predictions = classifier.predict(X_test)
print(f"First 10 Predictions:   {predictions[:100]}")
print(f"First 10 Actual labels: {y_test[:100].tolist()}")

First 10 Predictions:   ['Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good'
 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good' 'Good']
First 10 Actual labels: ['Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Bad', 'Bad', 'Bad', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Bad', 'Bad', 'Good', 'Good', 'Good', 'Bad', 'Bad', 'Bad', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Bad', 'Bad', 'Good', 'Bad', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Bad', 'Good', 'Good', 'Good', 'Bad', 'Good', 'Good', 'Bad']

In [51]:
y_test

28178     Bad
13617    Good
2583     Good
4880     Good
16527    Good
         ...
26737     Bad
29518    Good
30413    Good
4376     Good
14995    Good
Name: Label, Length: 2846, dtype: object

In [111]:
pd.DataFrame({"Prediction": predictions, "Actual": y_test}).nunique()

Prediction    1
Actual        2
dtype: int64